src_doc/InformationRegisters/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ПодразделенияОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает организацию, соответствующую переданному подразделению.
//
// Параметры:
//   Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение, для которого нужно получить организацию.
//
// Возвращаемое значение:
//   СправочникСсылка.Организации
//
Функция ОрганизацияПодразделения(Подразделение) Экспорт
	
	ОрганизацииПодразделений = ОрганизацииПодразделений(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделение));
	
	Возврат ОрганизацииПодразделений[Подразделение];
	
КонецФункции

// Возвращает организации, соответствующие переданным подразделениям.
//
// Параметры:
//   Подразделения - Массив из СправочникСсылка.СтруктураПредприятия - подразделения,
//     для которых нужно получить организации.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - соответствие подразделений и организаций:
//     * Ключ - СправочникСсылка.СтруктураПредприятия
//     * Значение - СправочникСсылка.Организации
//
Функция ОрганизацииПодразделений(Подразделения) Экспорт
	
	ОрганизацииПодразделений = Новый Соответствие;
	Для Каждого Подразделение Из Подразделения Цикл
		ОрганизацииПодразделений[Подразделение] = Неопределено;
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Подразделение КАК Подразделение,
		|	ПодразделенияОрганизаций.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Подразделение В (&Подразделения)");
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОрганизацииПодразделений[Выборка.Подразделение] = Выборка.Организация;
	КонецЦикла;

	Возврат ОрганизацииПодразделений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
